Repository: ANKerD/docs
Catalog: source/locale/*/LC_MESSAGES/design_and_installation/quick_starts/qs_centos_kvm.po
Languages: es

source: Quickstart: OpenNebula on CentOS 6 and KVM
es: Guía de Inicio Rápido: OpenNebula en CentOS 6 y KVM

source: The purpose of this guide is to provide users with step by step guide to install OpenNebula using CentOS 6 as the operating system and KVM as the hypervisor.
es: El propósito de esta guía es la de proveer a los usuarios con una guía paso a paso para instalar OpenNebula usando CentOS 6 como el sistema operativo y KVM como hipervisor.

source: After following this guide, users will have a working OpenNebula with graphical interface (Sunstone), at least one hypervisor (host) and a running virtual machines. This is useful at the time of setting up pilot clouds, to quickly test new features and as base deployment to build a large infrastructure.
es: Tras seguir esta guía, lo usuarios obtendrán un OpenNebula funcional con interfaz gráfico (Sunstone), al menos un hipervisor (host) y máquinas virtuales en ejecución. Es útil para desplegar pilotos de Cloud, y para probar rápidamente las nuevas funcionalidades como punto de partida para construir una infraestructura más extensa.

source: Throughout the installation there are two separate roles: **Frontend** and **Nodes**. The Frontend server will execute the OpenNebula services, and the Nodes will be used to execute virtual machines. Please not that **it is possible** to follow this guide with just one host combining both the Frontend and Nodes roles in a single server. However it is recommended execute virtual machines in hosts with virtualization extensions. To test if your host supports virtualization extensions, please run:
es: Durante la instalación habrá dos roles bien definidos: **Frontend** y **Nodos**. El servidor Frontend ejecutará los servicios de OpenNebula, y los Nodos servirán para ejecutar máquinas virtuales. Notar que **es posible** seguir esta guía con tan solo un host, combinando los roles de Frontend y Nodos en un solo servidor. Sin embargo, es recomendable ejecutar las máquinas virtuales en hosts con extensiones de virtualización. Para comprobar que el servidor soporta las extensiones de virtualización ejecute:

source: If you don't get any output you probably don't have virtualization extensions supported/enabled in your server.
es: Si no obtiene ninguna salida probablemente no tienen las extensiones de virtualización soportadas/activadas en su servidor.

source: Package Layout
es: Esquema de Paquetes

source: opennebula-server: OpenNebula Daemons
es: opennebula-server: Demonios de OpenNebula

source: opennebula: OpenNebula CLI commands
es: opennebula: Línea de comandos para OpenNebula

source: opennebula-sunstone: OpenNebula's web GUI
es: opennebula-sunstone: Interfaz Gráfico de OpenNebula

source: opennebula-ozones: OpenNebula's web GUI
es: opennebula-ozones: Servicio de múltiples zonas

source: opennebula-java: OpenNebula Java API
es: opennebula-java: API de Java

source: opennebula-node-kvm: Installs dependencies required by OpenNebula in the nodes
es: opennebula-node-kvm: Instala las dependecencias requeridas por OpenNebula en los nodos

source: opennebula-gate: Send information from Virtual Machines to OpenNebula
es: opennebula-gate: Componente que permite enviar información de las máquinas virtuales a OpenNebula

source: opennebula-flow: Manage OpenNebula Services
es: opennebula-flow: Gestión de servicios

source: opennebula-context: Package for OpenNebula Guests
es: opennebula-context: Paquete para huéspedes de OpenNebula

source: Additionally ``opennebula-common`` and ``opennebula-ruby`` exist but they're intended to be used as dependencies. ``opennebula-occi``, which is RESTful service to manage the cloud, is included in the ``opennebula-sunstone`` package.
es: Adicionalmente ``opennebula-common`` y ``opennebula-ruby`` existes pero se instalarán como dependencias. ``opennebula-occi``, un servicio REST para gestionar el cloud está incluido en el paquete ``opennebula-sunstone``.

source: Step 1. Installation in the Frontend
es: Paso 1. Instalación en el Frontend

source: Commands prefixed by ``#`` are meant to be run as ``root``. Commands prefixed by ``$`` must be run as ``oneadmin``.
es: Comandos con el prefijo de ``#`` deberán ser ejecutados como ``root``. Comandos con el prefijo de ``$`` deberán ser ejecutados como ``oneadmin``.

source: 1.1. Install the repo
es: 1.1. Instalar el repositorio

source: Enable the `EPEL <https://fedoraproject.org/wiki/EPEL>`__ repo:
es: Activar el repositorio de `EPEL <https://fedoraproject.org/wiki/EPEL>`__:

source: Add the OpenNebula repository:
es: Añadir el repositorio de OpenNebula:

source: 1.2. Install the required packages
es: 1.2. Instalación de los paquetes requeridos

source: A complete install of OpenNebula will have at least both ``opennebula-server`` and ``opennebula-sunstone`` package:
es: Una instalación completa de OpenNebula tendrá al menos los paquetes ``opennebula-server`` y ``opennebula-sunstone``:

source: 1.3. Configure and Start the services
es: 1.3. Configuración e Inicio de servicios

source: There are two main processes that must be started, the main OpenNebula daemon: ``oned``, and the graphical user interface: ``sunstone``.
es: Hay dos procesos principales que se han de iniciar, el demonio principal de OpenNebul: ``oned``, y el interfaz gráfico: ``sunstone``.

source: ``Sunstone`` listens only in the loopback interface by default for security reasons. To change it edit ``/etc/one/sunstone-server.conf`` and change ``:host: 127.0.0.1`` to ``:host: 0.0.0.0``.
es: ``Sunstone`` mantiene la escucha en el interfaz loopback for defecto por cuestiones de seguridad. Para cambiarlo hará falta editar ``/etc/one/sunstone-server.conf`` y cambiar ``:host: 127.0.0.1`` por ``:host: 0.0.0.0``.

source: Now we can start the services:
es: Se pueden iniciar los servicios:

source: 1.4. Configure NFS
es: 1.4. Configuración de NFS

source: Skip this section if you are using a single server for both the frontend and worker node roles.
es: Pase a la siguiente sección si está utilizando un solo servidor tanto para el Frontend como para los Nodos.

source: Export ``/var/lib/one/`` from the frontend to the worker nodes. To do so add the following to the ``/etc/exports`` file in the frontend:
es: Exportar ``/var/lib/one`` desde el Frontend a los Nodos. Para hacerlo añadir la siguiente línea al fichero ``/etc/exports`` en el Frontend:

source: Refresh the NFS exports by doing:
es: Refrescar los puntos de exportación de NFS haciendo:

source: 1.5. Configure SSH Public Key
es: 1.5. Configuración de la Clave Pública SSH

source: OpenNebula will need to SSH passwordlessly from any node (including the frontend) to any other node.
es: OpenNebula necesitar poder acceder sin password por SSH desde cualquier nodo (incluyendo el Frontend) a cualquier otro nodo.

source: Add the following snippet to ``~/.ssh/config`` as ``oneadmin`` so it doesn't prompt to add the keys to the ``known_hosts`` file:
es: Añadir el siguiente fragmento de código a ``~/.ssh/config`` como el usuario ``oneadmin`` de forma que no aparezca un diálogo para añadir las claves al fichero ``known_hosts``:

source: Step 2. Installation in the Nodes
es: Paso 2. Instalación en los Nodos

source: 2.1. Install the repo
es: 2.1. Instalación del Repositorio

source: 2.2. Install the required packages
es: 2.2. Instalación de los Paquetes Requeridos

source: Start the required services:
es: Inicie los servicios necesarios:

source: 2.3. Configure the Network
es: 2.3. Configurar la Red

source: Backup all the files that are modified in this section before making changes to them.
es: Realice copias de seguridad de todos aquellos ficheros que se modifiquen en esta sección antes de modificarlos.

source: You will need to have your main interface, typically ``eth0``, connected to a bridge. The name of the bridge should be the same in all nodes.
es: Deberá tener el interfaz principal de red, típicamente ``eth0``, conectado a un puente de red. El nombre del puente de red deberá ser el mismo en todos los nodos.

source: To do so, substitute ``/etc/sysconfig/network-scripts/ifcfg-eth0`` with:
es: Para hacerlo sustituya ``/etc/sysconfig/network-scripts/ifcfg-eth0`` con:

source: And add a new ``/etc/sysconfig/network-scripts/ifcfg-br0`` file.
es: Y añade un nuevo fichero ``/etc/sysconfig/network-scripts/ifcfg-br0``.

source: If you were using DHCP for your ``eth0`` interface, use this template:
es: Si está usando DHCP para su interfaz ``eth0``, utilice este template:

source: If you were using a static IP address use this other template:
es: Si está usando una IP estática use este otro template:

source: After these changes, restart the network:
es: Tras aplicar estos cambios, reinicie la red:

source: Mount the datastores export. Add the following to your ``/etc/fstab``:
es: Monte el punto de montaje de los datastores. Añada el siguiente fragmento de cṕdigo a ``/etc/fstab``:

source: Replace ``192.168.1.1`` with the IP of the frontend.
es: Reemplace ``192.168.1.1`` con la IP de su Frontend.

source: Mount the NFS share:
es: Monte el NFS:

source: Step 3. Basic Usage
es: Paso 3. Uso Básico

source: All the operations in this section can be done using Sunstone instead of the command line. Point your browser to: ``http://frontend:9869``.
es: Todas las operaciones de esta sección se podrán realizar desde Sunstone en lugar de desde la línea de comandos. Abra la dirección: ``http://frontend:9869``.

source: The default password for the ``oneadmin`` user can be found in ``~/.one/one_auth`` which is randomly generated on every installation.
es: La password por defecto de ``oneadmin`` se puede encontrar en ``~/.one/one_auth``, siendo generada aleatoriamente en cada instalación.

source: To interact with OpenNebula, you have to do it from the ``oneadmin`` account in the frontend. We will assume all the following commands are performed from that account. To login as ``oneadmin`` execute ``su - oneadmin``.
es: Para interactuar con OpenNebula, deberá hacerlo desde la cuenta de ``oneadmin`` en el Frontend. Asumiremos que todos los comandos serán realizados desde esa cuenta. Para hacer login como ``oneadmin``, ejecute ``su - oneadmin``.

source: 3.1. Adding a Host
es: 3.1. Añadir un Nodo

source: To start running VMs, you should first register a worker node for OpenNebula.
es: Para arrancar las MVs, deberá registrar un Nodo en OpenNebula.

source: Issue this command for each one of your nodes. Replace ``localhost`` with your node's hostname.
es: Ejecute el siguiente comando en cada uno de sus nodos. Reemplace ``localhost`` con el nombre del nodo.

source: Run ``onehost list`` until it's set to on. If it fails you probably have something wrong in your ssh configuration. Take a look at ``/var/log/one/oned.log``.
es: Ejecute ``onehost list`` hasta que el host este en ``on``. Si falla probablemente será debido a la configuración SSH. Mire el contenido de ``/var/log/one/oned.log``.

source: 3.2. Adding virtual resources
es: 3.2. Añadir Recursos Virtuales

source: Once it's working you need to create a network, an image and a virtual machine template.
es: Una vez que esté funcionando, deberá crear una red, una imagen y una plantilla de máquina virtual.

source: To create networks, we need to create first a network template file ``mynetwork.one`` that contains:
es: Para crear redes, se deberá crear primero un fichero de plantilla de red ``mynetwork.one`` que contendrá:

source: Replace the leases with free IPs in your host's network. You can add any number of leases.
es: Reemplace las direcciones IP con IPs disponibles en la red de su Nodo. Podrá añadir cualquier número de IPs.

source: Now we can move ahead and create the resources in OpenNebula:
es: A continuación se procederá a crear los recursos en OpenNebula:

source: (The image will be downloaded from `http://wiki.centos.org/Cloud/OpenNebula <http://wiki.centos.org/Cloud/OpenNebula>`__)
es: (La imagen será descargada de `http://wiki.centos.org/Cloud/OpenNebula <http://wiki.centos.org/Cloud/OpenNebula>`__)

source: You will need to wait until the image is ready to be used. Monitor its state by running ``oneimage list``.
es: Deberá esperar hasta que la imagen esté lista para ser usada. Monitorice el estado ejecutando ``oneimage list``.

source: In order to dynamically add ssh keys to Virtual Machines we must add our ssh key to the user template, by editing the user template:
es: Para añadir las claves SSH dinámicamente a las Máquinas Virtuales, deberemos añadir la clave SSH a la plantilla de nuestro usuario:

source: Add a new line like the following to the template:
es: Añadir una línea nueva como la siguiente a la plantilla:

source: Substitute the value above with the output of ``cat ~/.ssh/id_dsa.pub``.
es: Reemplace el valor mostrado arriba con la salida del comando ``cat ~/.ssh/id_dsa.pub``.

source: 3.3. Running a Virtual Machine
es: 3.3. Ejecutar una Máquina Virtual

source: To run a Virtual Machine, you will need to instantiate a template:
es: Para ejecutar una Máquina Virtual, deberá instanciar la plantilla:

source: Execute ``onevm list`` and watch the virtual machine going from PENDING to PROLOG to RUNNING. If the vm fails, check the reason in the log: ``/var/log/one/<VM_ID>/vm.log``.
es: Ejecute ``onevm list`` y observe cómo transiciona de PENDING a PROLOGO a RUNNING. SI la MV falla, podrá averiguar por qué en el log: ``/var/log/one/<VM_ID>/vm.log``.

source: Further information
es: Más Información

source: :ref:`Planning the Installation <plan>`
es: :ref:`Planeando la Instalación <plan>`

source: :ref:`Installing the Software <ignc>`
es: :ref:`Instalación del Software <ignc>`

source: `FAQs. Good for troubleshooting <http://wiki.opennebula.org/faq>`__
es: `FAQs. Útiles para depuración de problemas <http://wiki.opennebula.org/faq>`__

source: :ref:`Main Documentation <entry_point>`
es: :ref:`Documentación Principal <entry_point>`
